<template>
  <div class="bg-zinc-100 min-h-screen pb-8">
    <LayoutsBaseHeader :title="t('ข้อกำหนดและเงื่อนไขความเป็นส่วนตัว')" showBack />

    <section class=" p-4 mx-4 mt-4">
      <h1 class="text-lg font-bold text-gray-800 mb-4">
        {{ t('ข้อกำหนดและเงื่อนไขการให้บริการ') }}
      </h1>

      <div class="text-sm text-gray-700 space-y-3 leading-relaxed">
        <p>การเข้าเป็นสมาชิกของผู้ใช้บริการ</p>
        <p>เพื่อให้ผู้ใช้บริการสามารถใช้บริการเว็บไซต์ของทางบริษัทได้อย่างครบถ้วน</p>
        <p>ผู้ใช้บริการสามารถสมัครเข้าเป็นสมาชิกได้ตามวิธีที่บริษัทกำหนดไว้ในเว็บไซต์ อย่างไรก็ตาม</p>
        <p>บริษัทขอสงวนสิทธิที่จะปฏิเสธการสมัครสมาชิกของผู้ใช้บริการบางท่าน</p>
        <p>และบริษัทมีสิทธิยกเลิกการสมัครสมาชิกหรือระงับการใช้บริการของผู้ใช้บริการทุกรายได้ตลอดเวลา</p>
        <p>กรณีที่เกิดเหตุแห่งการฝ่าฝืนเงื่อนไขการให้บริการเว็บไซต์ หรือกรณีที่บริษัทเชื่อว่า แลกเปลี่ยน</p>
        <p>หรือใช้นโยบายบริษัทในรูปแบบอื่น เป็นต้น</p>
      </div>
    </section>
  </div>
</template>

<script setup>
import { useI18n } from 'vue-i18n'

const { t } = useI18n()
</script>